In [1]:
#Q.outer join을 사용하여 데이터를 출력하시오
import pandas as pd
emp=pd.read_csv("d:\\data\\emp3.csv")
dept=pd.read_csv("d:\\data\\dept3.csv")
result=pd.merge(emp,dept,on='deptno',how='left')
print(result[['ename','loc']])

     ename       loc
0     KING  NEW YORK
1    BLAKE   CHICAGO
2    CLARK  NEW YORK
3    JONES    DALLAS
4   MARTIN   CHICAGO
5    ALLEN   CHICAGO
6   TURNER   CHICAGO
7    JAMES   CHICAGO
8     WARD   CHICAGO
9     FORD    DALLAS
10   SMITH    DALLAS
11   SCOTT    DALLAS
12   ADAMS    DALLAS
13  MILLER  NEW YORK

In [2]:
#Q.부서번호, 부서번호별 평균월급을 출력하시오
import pandas as pd
emp=pd.read_csv("d:\\data\\emp3.csv")
result=emp.groupby('deptno')['sal'].mean().reset_index()
print(result)

   deptno          sal
0      10  2916.666667
1      20  2175.000000
2      30  1566.666667

In [3]:
#Q.위의 결과에서 평균 월급을 출력할 때 정수부분만 출력되게 하시오
import pandas as pd
emp=pd.read_csv("d:\\data\\emp3.csv")
result=emp.groupby('deptno')['sal'].mean().reset_index().astype(int)
print(result)

   deptno   sal
0      10  2916
1      20  2175
2      30  1566

In [4]:
#Q.직업, 직업별 토탈월급을 출력하시오
import pandas as pd
emp=pd.read_csv("d:\\data\\emp3.csv")
result=emp.groupby('job')['sal'].sum().reset_index()
print(result)

         job   sal
0    ANALYST  6000
1      CLERK  4150
2    MANAGER  8275
3  PRESIDENT  5000
4   SALESMAN  5600

In [5]:
#Q.부서위치, 부서위치별 토탈월급을 출력하시오 (조인해야 함)
import pandas as pd
emp=pd.read_csv("d:\\data\\emp3.csv")
dept=pd.read_csv("d:\\data\\dept3.csv")
result=pd.merge(emp,dept,on='deptno')
result2=result.groupby('loc')['sal'].sum().reset_index()
print(result2)

        loc    sal
0   CHICAGO   9400
1    DALLAS  10875
2  NEW YORK   8750

In [6]:
#Q.이번에는 위의 문제에서 BOSTON도 출력되게 하시오
import pandas as pd
emp=pd.read_csv("d:\\data\\emp3.csv")
dept=pd.read_csv("d:\\data\\dept3.csv")
result=pd.merge(emp,dept,on='deptno',how='right')
result2=result.groupby('loc')['sal'].sum().reset_index()
print(result2)

        loc      sal
0    BOSTON      0.0
1   CHICAGO   9400.0
2    DALLAS  10875.0
3  NEW YORK   8750.0

In [7]:
#Q.아래의 SQL을 판다스로 구현하시오
#select deptno, count(*) from emp group by deptno;
import pandas as pd
emp=pd.read_csv("d:\\data\\emp3.csv")
result=emp.groupby('deptno')['empno'].count().reset_index()
print(result)

   deptno  empno
0      10      3
1      20      5
2      30      6

In [10]:
#Q.통신사, 통신사별 인원수를 출력하시오
import pandas as pd
emp12=pd.read_csv("d:\\data\\emp122.csv")
result=emp12.groupby('TELECOM')['ENAME'].count().reset_index()
print(result)

  TELECOM  ENAME
0      kt     15
1      lg      4
2      sk     11

In [12]:
#Q.우리반 테이블에서 kt통신사를 사용하는 30세 이상인 학생의 나이와 통신사를 출력하시오
import pandas as pd
emp12=pd.read_csv("d:\\data\\emp122.csv")
print(emp12[['AGE','TELECOM']][(emp12['TELECOM']=='kt') & (emp12['AGE']>=30)])

   AGE TELECOM
1   31      kt

In [13]:
#Q.판다스를 이용하지 않고 파이썬으로만 emp3.csv에서 이름, 월급을 출력하시오
import csv
file=open("d:\\data\\emp22.csv") #os에 있는 emp2.csv를 읽어서 file이라는 변수에 넣는다
emp_csv=csv.reader(file) #file 변수에있는 csv파일을 읽어서 emp_csv변수에 넣는다.
print(emp_csv) #이 상태에서 그냥 프린트하면 메모리 주소만 나옵니다. 
for emp_list in emp_csv: #csv파일의 내용을 한 행씩 리스트에 담아서 
    print(emp_list[1], emp_list[5]) #출력합니다.

<_csv.reader object at 0x000002487BC3DCA0>
KING 5000
BLAKE 2850
CLARK 2450
JONES 2975
MARTIN 1250
ALLEN 1600
TURNER 1500
JAMES 950
WARD 1250
FORD 3000
SMITH 800
SCOTT 3000
ADAMS 1100
MILLER 1300

In [14]:
#Q.판다스를 이용하지 말고 이름, 월급*12.3을 출력하시오
import csv
file=open("d:\\data\\emp22.csv") #os에 있는 emp2.csv를 읽어서 file이라는 변수에 넣는다
emp_csv=csv.reader(file) #file 변수에있는 csv파일을 읽어서 emp_csv변수에 넣는다.
print(emp_csv) #이 상태에서 그냥 프린트하면 메모리 주소만 나옵니다. 
for emp_list in emp_csv: #csv파일의 내용을 한 행씩 리스트에 담아서 
    print(emp_list[1], int(emp_list[5])*12.3)

<_csv.reader object at 0x000002487BC3DDC0>
KING 61500.0
BLAKE 35055.0
CLARK 30135.0
JONES 36592.5
MARTIN 15375.0
ALLEN 19680.0
TURNER 18450.0
JAMES 11685.0
WARD 15375.0
FORD 36900.0
SMITH 9840.0
SCOTT 36900.0
ADAMS 13530.0
MILLER 15990.000000000002

In [15]:
#Q.위의 결과를 다시 출력하는데 소수점 첫번째 자리에서 반올림되게 하시오
import csv
file=open("d:\\data\\emp22.csv") 
emp_csv=csv.reader(file) 
print(emp_csv) 
for emp_list in emp_csv:
    print(emp_list[1], round(int(emp_list[5])*12.3))

<_csv.reader object at 0x000002487BC3DFA0>
KING 61500
BLAKE 35055
CLARK 30135
JONES 36592
MARTIN 15375
ALLEN 19680
TURNER 18450
JAMES 11685
WARD 15375
FORD 36900
SMITH 9840
SCOTT 36900
ADAMS 13530
MILLER 15990

In [16]:
#Q.직업이 SALESMAN인 사원들의 이름, 직업을 출력하는데 판다스 이용하지말고 출력하시오
import csv
file=open("d:\\data\\emp22.csv") 
emp_csv=csv.reader(file) 
print(emp_csv) 
for emp_list in emp_csv:
    if emp_list[2]=='SALESMAN':
        print(emp_list[1],emp_list[2])

<_csv.reader object at 0x000002487BC3DEE0>
MARTIN SALESMAN
ALLEN SALESMAN
TURNER SALESMAN
WARD SALESMAN

In [17]:
#Q.부서번호가 20번인 사원들의 이름, 월급, 부서번호를 출력하시오
#판다스 버전:
import pandas as pd
emp=pd.read_csv("d:\\data\\emp3.csv")
print(emp[['ename','sal','deptno']][emp['deptno']==20])

#판다스 아닌 버전:
import csv
file=open("d:\\data\\emp22.csv") 
emp_csv=csv.reader(file) 
print(emp_csv) 
for emp_list in emp_csv:
    if emp_list[7]=='20':
        print(emp_list[1],emp_list[5],emp_list[7])

    ename   sal  deptno
3   JONES  2975      20
9    FORD  3000      20
10  SMITH   800      20
11  SCOTT  3000      20
12  ADAMS  1100      20
<_csv.reader object at 0x000002487BAE5700>
JONES 2975 20
FORD 3000 20
SMITH 800 20
SCOTT 3000 20
ADAMS 1100 20

In [18]:
#Q.판다스를 이용해서 emp3를 읽고 이름, 월급을 출력하는데 월급을 출력할때 
#소수점 이하는 버리고 정수부분만 출력되게 하시오
import pandas as pd
emp=pd.read_csv("d:\\data\\emp3.csv")
print(emp[['ename','sal']])

     ename   sal
0     KING  5000
1    BLAKE  2850
2    CLARK  2450
3    JONES  2975
4   MARTIN  1250
5    ALLEN  1600
6   TURNER  1500
7    JAMES   950
8     WARD  1250
9     FORD  3000
10   SMITH   800
11   SCOTT  3000
12   ADAMS  1100
13  MILLER  1300

In [20]:
#Q.판다스로 이름, 월급을 출력하는데 월급을 실수형으로 출력하시오
import pandas as pd
emp=pd.read_csv("d:\\data\\emp3.csv")
emp['sal']=emp['sal'].apply(float) #emp 데이터 프레임의 sal 컬럼의 데이터를 float로 변환해서 emp데프의 sal에 변경해서 입력
print(emp[['ename','sal']])

     ename     sal
0     KING  5000.0
1    BLAKE  2850.0
2    CLARK  2450.0
3    JONES  2975.0
4   MARTIN  1250.0
5    ALLEN  1600.0
6   TURNER  1500.0
7    JAMES   950.0
8     WARD  1250.0
9     FORD  3000.0
10   SMITH   800.0
11   SCOTT  3000.0
12   ADAMS  1100.0
13  MILLER  1300.0

In [21]:
#짝수만 추출해내는 코드 작성
def get_even(num):
    if num%2==0:
        return num
    else:
        return
    
print(get_even(2))
print(get_even(7))

a=[1,2,3,4,5,6,7,8,9,10]
result=filter(get_even, a)
print(list(result)) #list 함수로 리스트로 변환해야 결과가 출력됩니다.

2
None
[2, 4, 6, 8, 10]

In [22]:
#Q.아래의 리스트에서 숫자가 300이상이면 출력하고 300미만이면 출력되지 않게 하시오
b=[100,352,254,456,123,234,567,903]
def get_300(num):
    if num>=300:
        return num
    else:
        return
    
result=filter(get_300,b)
print(list(result))

[352, 456, 567, 903]

In [24]:
#Q.우리반 데이터에서 나이가 30살 이상인 나이만 따로 결과로 리스트로 출력하시오
import pandas as pd
emp122=pd.read_csv("d:\\data\\emp122.csv")
a=[]
for i in emp122['AGE']:
    if i >=30:
        a.append(i)
print(a)

[31, 35, 33, 30, 36, 44]

In [25]:
#Q.사원테이블에서 최대월급을 출력하시오
#판다스:
import pandas as pd
emp=pd.read_csv("d:\\data\\emp3.csv")
print(emp['sal'].max())
    
#판다스 아닌 버전:
import csv
file=open("d:\\data\\emp22.csv") 
emp=csv.reader(file)
a=[]
for i in emp:
    a.append(int(i[5]))
print(max(a))

5000
5000

In [28]:
#Q.우리반 데이터에서 최소나이를 출력하시오
#판다스:
import  pandas  as  pd
emp122 = pd.read_csv("d:\\data\\emp122.csv")
print ( emp122['AGE'].min() )

24

In [29]:
#Q.판다스를 이용해서 커미션이 결측치인 사원들의 이름, 커미션을 출력하시오 
import pandas as pd
emp=pd.read_csv("d:\\data\\emp3.csv")
print(emp[['ename','comm']][emp['comm'].isnull()])

     ename  comm
0     KING   NaN
1    BLAKE   NaN
2    CLARK   NaN
3    JONES   NaN
7    JAMES   NaN
9     FORD   NaN
10   SMITH   NaN
11   SCOTT   NaN
12   ADAMS   NaN
13  MILLER   NaN

In [30]:
#Q.판다스를 이용해서 커미션이 결측치가 아닌 사원들의 이름, 커미션을 출력하시오 
import pandas as pd
emp=pd.read_csv("d:\\data\\emp3.csv")
print(emp[['ename','comm']][~emp['comm'].isnull()])

    ename    comm
4  MARTIN  1400.0
5   ALLEN   300.0
6  TURNER     0.0
8    WARD   500.0

In [31]:
#데이터에 결측치가 있는지 확인하는 방법
import pandas as pd
emp=pd.read_csv("d:\\data\\emp3.csv")
print(emp.isnull().sum()) #sum()하면 컬럼별 결측치 개수가 나옴

index        0
empno        0
ename        0
job          0
mgr          1
hiredate     0
sal          0
comm        10
deptno       0
dtype: int64

In [32]:
#Q.타이타닉 데이터에 결측치가 어느 컬럼에 많은지 확인하시오
import pandas as pd
train=pd.read_csv("d:\\data\\train.csv")
print(train.isnull().sum())

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [33]:
#Q.emp데이터 프레임에 sal2컬럼을 추가하고 해당 사원의 부서위치로 값을 갱신하시오
import pandas as pd
emp=pd.read_csv("d:\\data\\emp3.csv")
emp['sal2']=emp['sal']#emp데프에 sal2컬럼을 추가하는데 데이터는 emp데프에 sal로 하시오
print(emp)

    index  empno   ename        job     mgr         hiredate   sal    comm  \
0       1   7839    KING  PRESIDENT     NaN  1981-11-17 0:00  5000     NaN
1       2   7698   BLAKE    MANAGER  7839.0  1981-05-01 0:00  2850     NaN
2       3   7782   CLARK    MANAGER  7839.0  1981-05-09 0:00  2450     NaN
3       4   7566   JONES    MANAGER  7839.0  1981-04-01 0:00  2975     NaN
4       5   7654  MARTIN   SALESMAN  7698.0  1981-09-10 0:00  1250  1400.0
5       6   7499   ALLEN   SALESMAN  7698.0  1981-02-11 0:00  1600   300.0
6       7   7844  TURNER   SALESMAN  7698.0  1981-08-21 0:00  1500     0.0
7       8   7900   JAMES      CLERK  7698.0  1981-12-11 0:00   950     NaN
8       9   7521    WARD   SALESMAN  7698.0  1981-02-23 0:00  1250   500.0
9      10   7902    FORD    ANALYST  7566.0  1981-12-11 0:00  3000     NaN
10     11   7369   SMITH      CLERK  7902.0  1980-12-09 0:00   800     NaN
11     12   7788   SCOTT    ANALYST  7566.0  1982-12-22 0:00  3000     NaN
12     13   7876   ADAMS      CLERK  7788.0  1983-01-15 0:00  1100     NaN
13     14   7934  MILLER      CLERK  7782.0  1982-01-11 0:00  1300     NaN

    deptno  sal2
0       10  5000
1       30  2850
2       10  2450
3       20  2975
4       30  1250
5       30  1600
6       30  1500
7       30   950
8       30  1250
9       20  3000
10      20   800
11      20  3000
12      20  1100
13      10  1300

In [34]:
#Q.emp데이터프레임에 loc컬럼을 추가하고 해당 사원의 부서위치로 값을 갱신하시오
import pandas as pd
emp=pd.read_csv("d:\\data\\emp3.csv")
dept=pd.read_csv("d:\\data\\dept3.csv")
result=pd.merge(emp, dept, how='inner', on='deptno')
emp['loc']=result['loc']
print(emp)

    index  empno   ename        job     mgr         hiredate   sal    comm  \
0       1   7839    KING  PRESIDENT     NaN  1981-11-17 0:00  5000     NaN
1       2   7698   BLAKE    MANAGER  7839.0  1981-05-01 0:00  2850     NaN
2       3   7782   CLARK    MANAGER  7839.0  1981-05-09 0:00  2450     NaN
3       4   7566   JONES    MANAGER  7839.0  1981-04-01 0:00  2975     NaN
4       5   7654  MARTIN   SALESMAN  7698.0  1981-09-10 0:00  1250  1400.0
5       6   7499   ALLEN   SALESMAN  7698.0  1981-02-11 0:00  1600   300.0
6       7   7844  TURNER   SALESMAN  7698.0  1981-08-21 0:00  1500     0.0
7       8   7900   JAMES      CLERK  7698.0  1981-12-11 0:00   950     NaN
8       9   7521    WARD   SALESMAN  7698.0  1981-02-23 0:00  1250   500.0
9      10   7902    FORD    ANALYST  7566.0  1981-12-11 0:00  3000     NaN
10     11   7369   SMITH      CLERK  7902.0  1980-12-09 0:00   800     NaN
11     12   7788   SCOTT    ANALYST  7566.0  1982-12-22 0:00  3000     NaN
12     13   7876   ADAMS      CLERK  7788.0  1983-01-15 0:00  1100     NaN
13     14   7934  MILLER      CLERK  7782.0  1982-01-11 0:00  1300     NaN

    deptno       loc
0       10  NEW YORK
1       30  NEW YORK
2       10  NEW YORK
3       20   CHICAGO
4       30   CHICAGO
5       30   CHICAGO
6       30   CHICAGO
7       30   CHICAGO
8       30   CHICAGO
9       20    DALLAS
10      20    DALLAS
11      20    DALLAS
12      20    DALLAS
13      10    DALLAS

In [35]:
#Q.직업, 직업별 평균월급을 판다스로 출력하는데 월급의 소수점은 떼고 출력하시오
import pandas as pd
emp=pd.read_csv("d:\\data\\emp3.csv")
result=emp.groupby('job')['sal'].mean().reset_index()
result['sal']=result['sal'].astype(int) #result 데프에 sal을 정수형으로 변환해서
print(result) #result데프에 sal에 반영하겠다

         job   sal
0    ANALYST  3000
1      CLERK  1037
2    MANAGER  2758
3  PRESIDENT  5000
4   SALESMAN  1400

In [36]:
#Q.emp와 result를 서로 조인해서 조인된 전체 데이터 프레임을 출력하시오
import pandas as pd
emp=pd.read_csv("d:\\data\\emp3.csv")
result2=pd.merge(emp, result, how='inner', on='job')
print(result2)
#remp에도 sal이 있고, result에도 sal이 있어서 emp의 sal은 컬럼명이 sal_x로 변경되었고 result의 sal은
#sal_y로 변경되었습니다. sal_y는 해당 직업의 평균월급입니다.

    index  empno   ename        job     mgr         hiredate  sal_x    comm  \
0       1   7839    KING  PRESIDENT     NaN  1981-11-17 0:00   5000     NaN
1       2   7698   BLAKE    MANAGER  7839.0  1981-05-01 0:00   2850     NaN
2       3   7782   CLARK    MANAGER  7839.0  1981-05-09 0:00   2450     NaN
3       4   7566   JONES    MANAGER  7839.0  1981-04-01 0:00   2975     NaN
4       5   7654  MARTIN   SALESMAN  7698.0  1981-09-10 0:00   1250  1400.0
5       6   7499   ALLEN   SALESMAN  7698.0  1981-02-11 0:00   1600   300.0
6       7   7844  TURNER   SALESMAN  7698.0  1981-08-21 0:00   1500     0.0
7       9   7521    WARD   SALESMAN  7698.0  1981-02-23 0:00   1250   500.0
8       8   7900   JAMES      CLERK  7698.0  1981-12-11 0:00    950     NaN
9      11   7369   SMITH      CLERK  7902.0  1980-12-09 0:00    800     NaN
10     13   7876   ADAMS      CLERK  7788.0  1983-01-15 0:00   1100     NaN
11     14   7934  MILLER      CLERK  7782.0  1982-01-11 0:00   1300     NaN
12     10   7902    FORD    ANALYST  7566.0  1981-12-11 0:00   3000     NaN
13     12   7788   SCOTT    ANALYST  7566.0  1982-12-22 0:00   3000     NaN

    deptno  sal_y
0       10   5000
1       30   2758
2       10   2758
3       20   2758
4       30   1400
5       30   1400
6       30   1400
7       30   1400
8       30   1037
9       20   1037
10      20   1037
11      10   1037
12      20   3000
13      20   3000

In [37]:
#Q.emp데이터 프레임에 job_avgsal로 컬럼을 추가하고 위에서 구한 직업별 평균월급인 result2['sal_y']의 값으로 갱신하시오
import pandas as pd
emp=pd.read_csv("d:\\data\\emp3.csv")
result2=pd.merge(emp, result, how='inner', on='job')
emp['job_avgsal']=result2['sal_y']
print(emp)

    index  empno   ename        job     mgr         hiredate   sal    comm  \
0       1   7839    KING  PRESIDENT     NaN  1981-11-17 0:00  5000     NaN
1       2   7698   BLAKE    MANAGER  7839.0  1981-05-01 0:00  2850     NaN
2       3   7782   CLARK    MANAGER  7839.0  1981-05-09 0:00  2450     NaN
3       4   7566   JONES    MANAGER  7839.0  1981-04-01 0:00  2975     NaN
4       5   7654  MARTIN   SALESMAN  7698.0  1981-09-10 0:00  1250  1400.0
5       6   7499   ALLEN   SALESMAN  7698.0  1981-02-11 0:00  1600   300.0
6       7   7844  TURNER   SALESMAN  7698.0  1981-08-21 0:00  1500     0.0
7       8   7900   JAMES      CLERK  7698.0  1981-12-11 0:00   950     NaN
8       9   7521    WARD   SALESMAN  7698.0  1981-02-23 0:00  1250   500.0
9      10   7902    FORD    ANALYST  7566.0  1981-12-11 0:00  3000     NaN
10     11   7369   SMITH      CLERK  7902.0  1980-12-09 0:00   800     NaN
11     12   7788   SCOTT    ANALYST  7566.0  1982-12-22 0:00  3000     NaN
12     13   7876   ADAMS      CLERK  7788.0  1983-01-15 0:00  1100     NaN
13     14   7934  MILLER      CLERK  7782.0  1982-01-11 0:00  1300     NaN

    deptno  job_avgsal
0       10        5000
1       30        2758
2       10        2758
3       20        2758
4       30        1400
5       30        1400
6       30        1400
7       30        1400
8       30        1037
9       20        1037
10      20        1037
11      20        1037
12      20        3000
13      10        3000

In [40]:
#Q.판다스로 이름, 월급을 출력하는데 월급이 높은 사원부터 출력하시오
import pandas as pd
emp=pd.read_csv("d:\\data\\emp3.csv")
result=emp.sort_values('sal',ascending=False)
print(result)

    index  empno   ename        job     mgr         hiredate   sal    comm  \
0       1   7839    KING  PRESIDENT     NaN  1981-11-17 0:00  5000     NaN
9      10   7902    FORD    ANALYST  7566.0  1981-12-11 0:00  3000     NaN
11     12   7788   SCOTT    ANALYST  7566.0  1982-12-22 0:00  3000     NaN
3       4   7566   JONES    MANAGER  7839.0  1981-04-01 0:00  2975     NaN
1       2   7698   BLAKE    MANAGER  7839.0  1981-05-01 0:00  2850     NaN
2       3   7782   CLARK    MANAGER  7839.0  1981-05-09 0:00  2450     NaN
5       6   7499   ALLEN   SALESMAN  7698.0  1981-02-11 0:00  1600   300.0
6       7   7844  TURNER   SALESMAN  7698.0  1981-08-21 0:00  1500     0.0
13     14   7934  MILLER      CLERK  7782.0  1982-01-11 0:00  1300     NaN
4       5   7654  MARTIN   SALESMAN  7698.0  1981-09-10 0:00  1250  1400.0
8       9   7521    WARD   SALESMAN  7698.0  1981-02-23 0:00  1250   500.0
12     13   7876   ADAMS      CLERK  7788.0  1983-01-15 0:00  1100     NaN
7       8   7900   JAMES      CLERK  7698.0  1981-12-11 0:00   950     NaN
10     11   7369   SMITH      CLERK  7902.0  1980-12-09 0:00   800     NaN

    deptno
0       10
9       20
11      20
3       20
1       30
2       10
5       30
6       30
13      10
4       30
8       30
12      20
7       30
10      20

In [41]:
#Q.다음의 SQL을 판다스로 구현하시오
#select job, sum(sal) from emp group by job having sum(sal)>=6000 order by sum(sal) desc;
import pandas as pd
emp=pd.read_csv("d:\\data\\emp3.csv")
result=emp.groupby('job')['sal'].sum().reset_index()
result2=(result[['job','sal']] [result['sal']>=6000])
print(result2.sort_values('sal',ascending=False))

       job   sal
2  MANAGER  8275
0  ANALYST  6000